[
  {
    "id": "rattlesnake-ridge",
    "title": "Rattlesnake Ridge",
    "location": "Snoqualmie Region",
    "round-trip": "4.0 miles",
    "difficulty": "Easy",
    "description": "This is a very popular trail in the summer months. It is a short 30 minute drive from downtown Bellevue or under an hour away from Seattle. Not only does this trail provide you with great panoramic views from atop Rattlesnake Ridge but there is also a great park located down below. Many people come to the use the lake in the warmer months. There are no motored boats or fishing allowed on the lake which makes this place ideal for kayakers and swimmers alike."
  },
  {
    "id": "pretzel-tree",
    "title": "Pretzel Tree Trail",
    "location": "Issaquah Alps",
    "round-trip": "0.3 miles",
    "difficulty": "Easy",
    "description": "This is a great hike for you to take the kids on. The trail is short and has almost no elevation change to it. It also provides a little education on how the forest and its animals work together to form an ecosystem. You will follow Field Mouse, who is the lead character, while he takes his first hike into the forest. Along the way he will encounter several of the forest inhabitants who educate him on their jobs in the forest. As you follow along on his journey you will meet a crow, bugs, tree frog, woodpecker, beaver, and a squirrel. Each one of them will explain their role in the forest."
  },
  {
    "id": "coal-creek",
    "title": "Coal Creek Trail",
    "location": "Bellevue, WA",
    "round-trip": "6 miles",
    "difficulty": "Easy",
    "description": "This trail is an excellent finish to the four trails of Coal Creek Park. This trail offers the best views of Coal Creek and offers more of a challenge. The hills are not terribly steep but there are many and opportunity to rest is few. This trail is just over 4 miles out and back. I think it provides the best views of Coal Creek and will be the best hike in Coal Creek Park when all improvements have been completed. This trail has two parts. A lower trail and a higher ground trail. Combined it equals 6 miles but seperately it is around 2 miles."
  },
  {
    "id": "wildside-trail",
    "title": "Wildside Trail",
    "location": "Issaquah Alps",
    "round-trip": "4.2 miles",
    "difficulty": "Easy",
    "description": "Heading out from the parking area you will come to a trailhead marker for Red Town Trail and Wildside Trail. Take the path to the right to begin down the trail. The trail starts off wide and well maintained, however once you arrive at the first bridge the trail can get muddy. Once you cross over the stream you should see a short set of wooden stairs leading up. At the top of the stairs is the junction point for 3 different trails. Head to your left and continue on for 30-40 feet and you should see the trailhead marker to continue on the Wildside Trail. This is where the trail gets muddy; I would suggest having an extra pair of shoes to change into to keep your car clean. Once over the two small bridges you should not have any problems navigating the trail. In about .4 miles you should come to another trailhead marker for Marshall's Hill Trail. Continue straight and the end of the trail will be .3 away from the last junction. This last section can be really muddy; I have had mud come up past my high top boots on a few occasions. When you come to an area with two railroad ties sticking out of the ground you will be near the end of the trail. At the end of the trail you can make a left and take a look at the retention pond, but I would advise against this if you are hiking in the summer time as there will be mosquitoes."
  },
  {
  "id": "wenatchee-crest",
  "title": "Wenatchee Crest Snowshoe",
  "location": "Central Cascades",
  "round-trip": "6.0 miles",
  "difficulty": "Easy",
  "description": "The Wenatchee Crest near Blewett Pass is an ideal entry-level snowshoe, thanks to its modest elevation gain and panoramic views from the ridgetop. And even with such an easily accessible trailhead, the crowds are often minimal."
},
]
